
/**
 *
 字段解释
 "room_type"    :  "0201":"合租原房"  "0202”:"合租N+1"  "0203":"合租隔断房" "0204”:"整租单间"
 "business_type":  "1501”:"小区住宅"  "1502":"集中公寓"
 "pay_method"   :  "0101":"付三押一"  "0102":"付二押一"  "0103":"付一押一"
 */


#define   ROOM_TYPE         @{@"0201":@"合租原房",@"0202":@"合租N+1",@"0203":@"合租隔断房",@"0204":@"整租单间",@"0205":@"整租单间"}

#define   BUSINESS_TYPE     @{@"1501":@"小区住宅",@"1502":@"集中公寓",@"1503":@"酒店长租"}

#define   PAY_TYPE          @{@"0109":@"付一押零",@"0108":@"整年付",@"0107":@"半年付",@"0106":@"付一押二",@"0105":@"付二押二",@"0104":@"付三押二",@"0103":@"付一押一",@"0102":@"付二押一",@"0101":@"付三押一",@"0109":@"付一押零"}

#define   DIRECTION_TYPE    @{@"1007":@"东",@"1008":@"西",@"1009":@"南",@"1010":@"北",@"0103":@"东北",@"0104":@"东南",@"0103":@"XXX",@"0105":@"西北",@"1001":@"南北"}


#define  DECORATION_TYPE   @{@"0004":@"豪华装修",@"0003":@"精装修",@"0002":@"普通装修"}

#define  OWNER_LIKE_TYPE  @{@"0509":@"女生",@"0508":@"双人住",@"0507":@"单人住",@"0501":@"作息规律",@"0502":@"爱干净",@"0503":@"不吸烟"}

//数据库查询
/*
 user = [User findFirstWithFormat:[NSString stringWithFormat:@" where userId = %@",model.userId]];
 //正常是要去数据库查的，哈哈哒  model.userId
 User *user = [User findFirstByCriteria:[NSString stringWithFormat:@" where userId = %@",@""]];
*/

